gender_dict = {0: '男',
               1: '女'}

age_dict = {0: '16以下',
            1: '17-30',
            2: '34-45'}

body_dict = {0: '微胖',
             1: '标准',
             2: '偏瘦'}

hs_dict = {0: '戴帽',
           1: '眼镜',
           2: '围巾',
           3: '无'}

up_dict = {0: '衬衣',
           1: '毛衣',
           2: '马甲',
           3: 'T恤',
           4: '棉服',
           5: '夹克',
           6: '西服',
           7: '卫衣',
           8: '短袖'}

lb_dict = {0: '长裤',
           1: '裙子',
           2: '短裙',
           3: '连衣裙',
           4: '牛仔裤',
           5: '包腿裤'}

shoes_dict = {0: '皮鞋',
              1: '运动鞋',
              2: '靴子',
              3: '布鞋',
              4: '休闲鞋'}

attach_dict = {0: '双肩包',
               1: '单肩包',
               2: '手提包',
               3: '箱子',
               4: '塑料袋',
               5: '纸袋',
               6: '车',
               7: '无'}

action_dict = {0: '打电话',
               1: '交谈',
               2: '聚集',
               3: '抱东西',
               4: '推东西',
               5: '拉拽东西',
               6: '夹带东西',
               7: '拎东西',
               8: '其他'}

rap2_ub_dict = {
    0: '衬衣',
    1: '毛衣',
    2: '马甲',
    3: 'T恤',
    4: '棉服',
    5: '夹克',
    6: '西服',
    7: '卫衣',
    8: '短袖',
    9: '其他'
}

rap2_ub_tiny_dict = {
    0: '外套',
    1: '衬衣',
    2: '毛衣',
    3: 'T恤',
    4: '短袖'
}

rap2_color_dict = {
    0: '黑',
    1: '白',
    2: '灰',
    3: '红',
    4: '绿',
    5: '蓝',
    6: '银',
    7: '黄',
    8: '棕',
    9: '紫',
    10: '粉',
    11: '橙',
    12: '混色',
    13: '其他'
}

rap2_ub_color_tiny_dict = {
    0: '黑',
    1: '白',
    2: '灰',
    3: '红',
    4: '蓝',
    5: '黄'
}

rap2_lb_color_tiny_dict = {
    0: '黑',
    1: '白',
    2: '灰'
}

rap2_shoes_color_tiny_dict = {
    0: '黑',
    1: '白',
    2: '灰',
    3: '棕'
}

rap2_color_dict_ = {
    0: '黑',
    1: '白',
    2: '灰',
    3: '红',
    4: '黄',
    5: '混色',
    6: '其他'
}

rap2_lb_dict = {
    0: '长裤',
    1: '短裤',
    2: '裙子',
    3: '短裙',
    4: '长裙',
    5: '连衣裙',
    6: '牛仔裤',
    7: '包腿裤'
}

rap2_lb_tiny_dict = {
    0: '长裤',
    1: '短裤',
    2: '裙子',
    3: '牛仔裤'
}

rap2_bag_dict = {
    0: '双肩包',
    1: '单肩包'
}

unknown = '未知'
